---
title: ExternalDefinitionCreationOptions
classe: Autodesk.Revit.DB.ExternalDefinitionCreationOptions
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# ExternalDefinitionCreationOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Description { get; set; }` | `externalDefinitionCreationOptions.Description` | String |
| `Guid GUID { get; set; }` | `externalDefinitionCreationOptions.GUID` | Guid |
| `Boolean HideWhenNoValue { get; set; }` | `externalDefinitionCreationOptions.HideWhenNoValue` | Boolean |
| `Boolean IsValidObject { get; }` | `externalDefinitionCreationOptions.IsValidObject` | Boolean |
| `String Name { get; set; }` | `externalDefinitionCreationOptions.Name` | String |
| `Boolean UserModifiable { get; set; }` | `externalDefinitionCreationOptions.UserModifiable` | Boolean |
| `Boolean Visible { get; set; }` | `externalDefinitionCreationOptions.Visible` | Boolean |
| `Void Dispose()` | `externalDefinitionCreationOptions.Dispose()` | Void |
| `ForgeTypeId GetDataType()` | `externalDefinitionCreationOptions.GetDataType()` | ForgeTypeId |
| `Void SetDataType(ForgeTypeId)` | `externalDefinitionCreationOptions.SetDataType(dataType)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```